##
# Решение квадратного уравнения
# Медяновский Олег Вячеславович ИУ7-14Б

a, b, c = map(float, input('Введите коэффиценты квадратного уравнения: ').split())

if a == 0:
    if b == 0:
        if c == 0:
            print('Бесконечно много решений')
        else:
            print('Нет решений')
    else:
        x = -c/b
        print('Один корень {:.5}'.format(x))
else:
    D = b**2 - 2*a*c # Дискриминант
    if D < 0:
        print('Нет действительных решений')
    elif D == 0:
        x = -b/(2*a)
        print('Один корень {:.5}'.format(x))
    else:
        x1 = (-b + D**0.5)/(2*a)
        x2 = (-b - D**0.5)/(2*a)
        print('Два корня x1: {:.5} x2: {:.5}'.format(x1, x2))
