##
# Вычисления суммы ряда
# Медяновский Олег ИУ7-14Б

x = float(input('Введите аргумент функции x: '))
eps = float(input('Введите точность вычисления: '))
max_step_count = int(input('Введите максимальное число итераций: '))
step_print = int(input('Введите шаг печати: '))

n = 0

v = 1
res = 0
fac = 1.0
print('┌' + '─' * 12 + '┬' + '─' * 16 + '┬' + '─' * 16 + '┐')
print('│{:^12}│{:^16}│{:^16}│'.format('n', 'v', 'y'))
print('├' + '─' * 12 + '┼' + '─' * 16 + '┼' + '─' * 16 + '┤')
while abs(v) > eps and n <= max_step_count:
    v = (-1)**n * (2*n-1)/fac * x**(2*n)
    res += v
    if n % step_print == 0:
        print('│{:^12}│{:^16.9}│{:^16.9}│'.format(n, v, res))
    fac *= (n*2+1) * (n*2+2)
    n += 1

if n == max_step_count and abs(v) > eps:
    print('Ряд не сошелся за отведенное число итераций')
else:
    print('Ряд сошелся за отведенное число итераций')

print('└' + '─' * 12 + '┴' + '─' * 16 + '┴' + '─' * 16 + '┘')
print('Сумма равна: {:.9}'.format(res))